# Pandas 

##### Learning Resource --> https://youtu.be/2uvysYbKdjM?si=Yw11ahUCt_TOp-va

In [15]:
import pandas as pd
import numpy as np

In [16]:
df = pd.DataFrame([[1,2,3],[4,5,6],[7,8,9]], columns = ["A", "B", "C"], index = ["X", "Y", "Z"])

In [17]:
df.head()

   A  B  C
X  1  2  3
Y  4  5  6
Z  7  8  9

In [18]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 3 entries, X to Z
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       3 non-null      int64
 1   B       3 non-null      int64
 2   C       3 non-null      int64
dtypes: int64(3)
memory usage: 96.0+ bytes

In [19]:
df.describe()

         A    B    C
count  3.0  3.0  3.0
mean   4.0  5.0  6.0
std    3.0  3.0  3.0
min    1.0  2.0  3.0
25%    2.5  3.5  4.5
50%    4.0  5.0  6.0
75%    5.5  6.5  7.5
max    7.0  8.0  9.0

In [22]:
df.nunique()

A    3
B    3
C    3
dtype: int64

In [23]:
df["A"].nunique()

3

In [24]:
df.shape

(3, 3)

In [25]:
df.size

9

In [36]:
cf = pd.read_csv('coffee.csv')

In [37]:
cf

          Day Coffee Type  Units Sold
0      Monday    Espresso          25
1      Monday       Latte          15
2     Tuesday    Espresso          30
3     Tuesday       Latte          20
4   Wednesday    Espresso          35
5   Wednesday       Latte          25
6    Thursday    Espresso          40
7    Thursday       Latte          30
8      Friday    Espresso          45
9      Friday       Latte          35
10   Saturday    Espresso          45
11   Saturday       Latte          35
12     Sunday    Espresso          45
13     Sunday       Latte          35

In [38]:
cf.head()

         Day Coffee Type  Units Sold
0     Monday    Espresso          25
1     Monday       Latte          15
2    Tuesday    Espresso          30
3    Tuesday       Latte          20
4  Wednesday    Espresso          35

In [39]:
cf.shape

(14, 3)

In [40]:
cf.size

42

In [43]:
cf.to_parquet

<bound method DataFrame.to_parquet of           Day Coffee Type  Units Sold
0      Monday    Espresso          25
1      Monday       Latte          15
2     Tuesday    Espresso          30
3     Tuesday       Latte          20
4   Wednesday    Espresso          35
5   Wednesday       Latte          25
6    Thursday    Espresso          40
7    Thursday       Latte          30
8      Friday    Espresso          45
9      Friday       Latte          35
10   Saturday    Espresso          45
11   Saturday       Latte          35
12     Sunday    Espresso          45
13     Sunday       Latte          35>

In [44]:
cf.tail(5)

         Day Coffee Type  Units Sold
9     Friday       Latte          35
10  Saturday    Espresso          45
11  Saturday       Latte          35
12    Sunday    Espresso          45
13    Sunday       Latte          35

In [46]:
cf.sample(5)

         Day Coffee Type  Units Sold
4  Wednesday    Espresso          35
5  Wednesday       Latte          25
9     Friday       Latte          35
0     Monday    Espresso          25
3    Tuesday       Latte          20

In [50]:
cf.loc[[0,1,2]]

       Day Coffee Type  Units Sold
0   Monday    Espresso          25
1   Monday       Latte          15
2  Tuesday    Espresso          30

In [58]:
cf.loc[0:2, ["Day", "Units Sold"]]

       Day  Units Sold
0   Monday          25
1   Monday          15
2  Tuesday          30

In [63]:
cf.iloc[[0,5]]

         Day Coffee Type  Units Sold
0     Monday    Espresso          25
5  Wednesday       Latte          25

In [64]:
cf.index = cf.Day

In [65]:
cf

                 Day Coffee Type  Units Sold
Day
Monday        Monday    Espresso          25
Monday        Monday       Latte          15
Tuesday      Tuesday    Espresso          30
Tuesday      Tuesday       Latte          20
Wednesday  Wednesday    Espresso          35
Wednesday  Wednesday       Latte          25
Thursday    Thursday    Espresso          40
Thursday    Thursday       Latte          30
Friday        Friday    Espresso          45
Friday        Friday       Latte          35
Saturday    Saturday    Espresso          45
Saturday    Saturday       Latte          35
Sunday        Sunday    Espresso          45
Sunday        Sunday       Latte          35

In [66]:
cf.loc["Tuesday"]

             Day Coffee Type  Units Sold
Day
Tuesday  Tuesday    Espresso          30
Tuesday  Tuesday       Latte          20

In [69]:
cf.sort_values(["Coffee Type", "Units Sold"])

                 Day Coffee Type  Units Sold
Day
Monday        Monday    Espresso          25
Tuesday      Tuesday    Espresso          30
Wednesday  Wednesday    Espresso          35
Thursday    Thursday    Espresso          40
Friday        Friday    Espresso          45
Saturday    Saturday    Espresso          45
Sunday        Sunday    Espresso          45
Monday        Monday       Latte          15
Tuesday      Tuesday       Latte          20
Wednesday  Wednesday       Latte          25
Thursday    Thursday       Latte          30
Friday        Friday       Latte          35
Saturday    Saturday       Latte          35
Sunday        Sunday       Latte          35